In [1]:
import numpy as np
import pandas as pd

In [2]:
my_dict = {"james":[40,30,np.nan], "kirk":[20,np.nan,50], "lars": [30,50,40]} #james, kirk, lars'ın çalışma saatleri,

In [3]:
my_data_frame= pd.DataFrame(my_dict) #bu listeyi dataframe olarak yazdık.

In [4]:
my_data_frame

   james  kirk  lars
0   40.0  20.0    30
1   30.0   NaN    50
2    NaN  50.0    40

In [5]:
my_data_frame.dropna() #elimizde olmayan dataları çıkarır dropna. içinde nan geçen tüm satırları siler.

   james  kirk  lars
0   40.0  20.0    30

In [6]:
my_data_frame #değişmez

   james  kirk  lars
0   40.0  20.0    30
1   30.0   NaN    50
2    NaN  50.0    40

In [7]:
my_data_frame.dropna(axis=1) #içinde nan geçen kolonları temizler. axis = 0 ise bu default durumdadır.

   lars
0    30
1    50
2    40

In [8]:
my_dict = {"james":[40,30,np.nan], "kirk":[20,np.nan,50], "lars": [30,50,40], "rob":[45,np.nan,np.nan]} #rob ekledik.

In [9]:
my_new_data_frame = pd.DataFrame(my_dict)

In [10]:
my_new_data_frame

   james  kirk  lars   rob
0   40.0  20.0    30  45.0
1   30.0   NaN    50   NaN
2    NaN  50.0    40   NaN

In [12]:
my_new_data_frame.dropna(axis=1,thresh=2) #thresh min seviyeyi geçemezse onu drop et çıkar demektir. 2 yazarsak robb çıkar.yani en az 2 düzgün verisi olacak.

   james  kirk  lars
0   40.0  20.0    30
1   30.0   NaN    50
2    NaN  50.0    40

In [13]:
my_new_data_frame #değişmez.

   james  kirk  lars   rob
0   40.0  20.0    30  45.0
1   30.0   NaN    50   NaN
2    NaN  50.0    40   NaN

In [15]:
#bir veri eksikse onu doldurmak istiyoruz.
my_new_data_frame.fillna(20) #fillna doldur demektir. nan olanların yerine 20 yazar.

   james  kirk  lars   rob
0   40.0  20.0    30  45.0
1   30.0  20.0    50  20.0
2   20.0  50.0    40  20.0

groupby

In [49]:
salary_dict = {"programming language": ["python", "python","kotlin","swift","swift"], "Name": ["A","B","C","D","E"], "salary": [100,200,800,300,200]}

In [50]:
salary_frame = pd.DataFrame(salary_dict)

In [51]:
salary_frame

  programming language Name  salary
0               python    A     100
1               python    B     200
2               kotlin    C     800
3                swift    D     300
4                swift    E     200

In [52]:
group_object = salary_frame.groupby("programming language")

In [53]:
group_object.count() #count dediğimde hangisinden kaç kişi var onu gösterir. kotlinde bir swiftte iki kişi vra.

                      Name  salary
programming language
kotlin                   1       1
python                   2       2
swift                    2       2

In [58]:
group_object.mean("salary") #salary'nin ortalaması boş bırakırsak parametre kısmı hata verir.

                      salary
programming language
kotlin                 800.0
python                 150.0
swift                  250.0

In [55]:
group_object.min() #min kazanan kisi

                     Name  salary
programming language
kotlin                  C     800
python                  A     100
swift                   D     200

In [56]:
group_object.max() #max kazanan kişi

                     Name  salary
programming language
kotlin                  C     800
python                  B     200
swift                   E     300

In [59]:
group_object.min("salary") #salary'nin minimumu

                      salary
programming language
kotlin                   800
python                   100
swift                    200

In [60]:
group_object.min(numeric_only=True) #dizebildiklerini getirir. numara olanları getir.

                      salary
programming language
kotlin                   800
python                   100
swift                    200

In [61]:
group_object.describe() #describe bize bir özet çıkarır.

                     salary                                                \
                      count   mean        std    min    25%    50%    75%
programming language
kotlin                  1.0  800.0        NaN  800.0  800.0  800.0  800.0
python                  2.0  150.0  70.710678  100.0  125.0  150.0  175.0
swift                   2.0  250.0  70.710678  200.0  225.0  250.0  275.0


                        max
programming language
kotlin                800.0
python                200.0
swift                 300.0

In [62]:
my_dict1 = {"name":["a","b","c","d"],
           "sports":["basket", "football","tenis","running"],
           "calories":[100,200,400,600]}

In [75]:
my_frame1 = pd.DataFrame(my_dict1, index=[0,1,2,3])

In [76]:
my_frame1

  name    sports  calories
0    a    basket       100
1    b  football       200
2    c     tenis       400
3    d   running       600

In [77]:
my_dict2 = {"name":["e","f","g","h"],
           "sports":["basket", "football","tenis","running"],
           "calories":[900,100,500,800]}

In [78]:
my_frame2 = pd.DataFrame(my_dict2, index=[4,5,6,7])

In [79]:
my_frame2

  name    sports  calories
4    e    basket       900
5    f  football       100
6    g     tenis       500
7    h   running       800

In [80]:
my_dict3 = {"name":["ı","j","k","l"],
           "sports":["basket", "football","tenis","running"],
           "calories":[200,700,300,500]}

In [81]:
my_frame3 = pd.DataFrame(my_dict3, index=[8,9,10,11])

In [82]:
my_frame3

   name    sports  calories
8     ı    basket       200
9     j  football       700
10    k     tenis       300
11    l   running       500

In [83]:
#bu oluşturduğumuz 3 frame'i birleştirmek istiyoruz.
#concatenation

In [84]:
pd.concat([my_frame1, my_frame2, my_frame3]) # liste içinde frame'leri yazıp birleştirdik.

   name    sports  calories
0     a    basket       100
1     b  football       200
2     c     tenis       400
3     d   running       600
4     e    basket       900
5     f  football       100
6     g     tenis       500
7     h   running       800
8     ı    basket       200
9     j  football       700
10    k     tenis       300
11    l   running       500

In [85]:
# merge, birleştirmedir ama iç içe geçerek. Aynı olan verileri tutarak birleştirmeleri gerçekleştirir.

In [86]:
my_frame1

  name    sports  calories
0    a    basket       100
1    b  football       200
2    c     tenis       400
3    d   running       600

In [87]:
my_frame2

  name    sports  calories
4    e    basket       900
5    f  football       100
6    g     tenis       500
7    h   running       800

In [88]:
pd.merge(my_frame1, my_frame2, on="sports") #sports'a göre merge yaptı.

  name_x    sports  calories_x name_y  calories_y
0      a    basket         100      e         900
1      b  football         200      f         100
2      c     tenis         400      g         500
3      d   running         600      h         800

In [89]:
new_salary_frame = pd.DataFrame({"name": ["james","kirk","lars"], "salary": [10,20,30], "age": [60,70,50]})

In [90]:
new_salary_frame

    name  salary  age
0  james      10   60
1   kirk      20   70
2   lars      30   50

isimlerden kaç tane unique isim var. unique, birbiriyle çakışmayan demektir.

In [91]:
new_salary_frame["name"].unique() #unique ile array ismi verir.

array(['james', 'kirk', 'lars'], dtype=object)

In [92]:
new_salary_frame["name"].nunique() #number of unique direkt sayı verir.

3

In [93]:
#brüt maaş
def grossToNet(salary):
    return salary * 0.65

In [94]:
new_salary_frame["salary"].apply(grossToNet) #apply uygula yani dataframe salary'sine uygula. salary'leri fonksiyonda çalıştırdı.

0     6.5
1    13.0
2    19.5
Name: salary, dtype: float64